import { View, Text, StyleSheet, ScrollView } from "react-native";
import darkTheme from "../design-system/darkTheme";
import { useContext } from "react";
import ThemeContext from "../providers/ThemeContext";


export default function PrivacyPolicy({ navigation }) {

    const themeContext = useContext(ThemeContext);
    const styles = themeContext.getTheme() == "light" ? lightStyles : darkStyles;



    return (
        <ScrollView style={styles.container}>
            <View style={styles.content}>
                <Text style={styles.title}>
                    سياسة الخصوصية لشركة Vinkst

                </Text>
                <Text style={styles.text}>
                    في Vinkst ، الذي يمكن الوصول إليه من Vinkst ، تتمثل إحدى أولوياتنا الرئيسية في خصوصية زوارنا. تحتوي وثيقة سياسة الخصوصية هذه على أنواع المعلومات التي يتم جمعها وتسجيلها بواسطة Vinkst وكيفية استخدامنا لها.

                </Text>
                <Text style={styles.text}>
                    إذا كانت لديك أسئلة إضافية أو تحتاج إلى مزيد من المعلومات حول سياسة الخصوصية الخاصة بنا ، فلا تتردد في الاتصال بنا.

                </Text>

                <Text style={styles.text}>
                    تنطبق سياسة الخصوصية هذه فقط على أنشطتنا عبر الإنترنت وهي صالحة لزوار موقعنا الإلكتروني فيما يتعلق بالمعلومات التي شاركوها و / أو يجمعونها في Vinkst. لا تنطبق هذه السياسة على أي معلومات يتم جمعها في وضع عدم الاتصال أو عبر قنوات أخرى غير هذا الموقع.

                </Text>

                <Text style={[styles.text, styles.textTitle]}>
                    موافقة

                </Text>

                <Text style={styles.text}>
                    باستخدام موقعنا ، فإنك بذلك توافق على سياسة الخصوصية الخاصة بنا وتوافق على شروطها.

                </Text>

                <Text style={styles.text}>
                    المعلومات التي نجمعها

                </Text>

                <Text style={styles.text}>
                    سيتم توضيح المعلومات الشخصية التي يُطلب منك تقديمها ، وأسباب مطالبتك بتقديمها ، في الوقت الذي نطلب منك فيه تقديم معلوماتك الشخصية.

                </Text>

                <Text style={styles.text}>
                    إذا اتصلت بنا مباشرة ، فقد نتلقى معلومات إضافية عنك مثل اسمك وعنوان بريدك الإلكتروني ورقم هاتفك ومحتويات الرسالة و / أو المرفقات التي قد ترسلها إلينا وأي معلومات أخرى قد تختار تقديمها.

                </Text>

                <Text style={styles.text}>
                    عند التسجيل للحصول على حساب ، قد نطلب معلومات الاتصال الخاصة بك ، بما في ذلك عناصر مثل الاسم واسم الشركة والعنوان وعنوان البريد الإلكتروني ورقم الهاتف.

                </Text>

                <Text style={[styles.text, styles.textTitle]}>
                    كيف نستخدم معلوماتك

                </Text>

                <Text style={styles.text}>
                    نستخدم المعلومات التي نجمعها بطرق مختلفة ، بما في ذلك:

                </Text>

                <Text style={[styles.text, styles.textLine]}>
                    توفير وتشغيل وصيانة موقعنا

                </Text>

                <Text style={[styles.text, styles.textLine]}>
                    تحسين وتخصيص وتوسيع موقعنا

                </Text>

                <Text style={[styles.text, styles.textLine]}>
                    فهم وتحليل كيفية استخدامك لموقعنا

                </Text>

                <Text style={[styles.text, styles.textLine]}>
                    تطوير منتجات وخدمات وميزات ووظائف جديدة

                </Text>
                <Text style={[styles.text, styles.textLine]}>
                    التواصل معك ، إما بشكل مباشر أو من خلال أحد شركائنا ، بما في ذلك لخدمة العملاء ، لتزويدك بالتحديثات والمعلومات الأخرى المتعلقة بالموقع ولأغراض تسويقية وترويجية

                </Text>
                <Text style={[styles.text, styles.textLine]}>
                    أرسل لك رسائل البريد الإلكتروني

                </Text>
                <Text style={[styles.text, styles.textLine]}>
                    البحث عن ومنع الاحتيال

                </Text>


                <Text style={[styles.text, styles.textTitle]}>
                    ملفات الدخول

                </Text>



                <Text style={styles.text}>
                    تتبع Vinkst إجراءً قياسيًا لاستخدام ملفات السجل. تسجل هذه الملفات الزوار عندما يزورون مواقع الويب. تقوم جميع شركات الاستضافة بذلك وجزء من تحليلات خدمات الاستضافة. تتضمن المعلومات التي يتم جمعها بواسطة ملفات السجل عناوين بروتوكول الإنترنت (IP) ونوع المستعرض وموفر خدمة الإنترنت (ISP) وختم التاريخ والوقت وصفحات الإحالة / الخروج وربما عدد النقرات. هذه ليست مرتبطة بأي معلومات لتحديد الهوية الشخصية. الغرض من المعلومات هو تحليل الاتجاهات وإدارة الموقع وتتبع حركة المستخدمين على الموقع وجمع المعلومات الديموغرافية.

                </Text>

                <Text style={[styles.text, styles.textTitle]}>
                    ملفات تعريف الارتباط وإشارات الويب

                </Text>

                <Text style={styles.text}>
                    مثل أي موقع ويب آخر ، يستخدم Vinkst "ملفات تعريف الارتباط". تُستخدم ملفات تعريف الارتباط هذه لتخزين المعلومات بما في ذلك تفضيلات الزوار والصفحات الموجودة على موقع الويب التي قام الزائر بالوصول إليها أو زيارتها. تُستخدم المعلومات لتحسين تجربة المستخدمين من خلال تخصيص محتوى صفحة الويب الخاصة بنا بناءً على نوع متصفح الزوار و / أو معلومات أخرى.

                </Text>

                <Text style={[styles.text, styles.textTitle]}>
                    كوكيز دبل كليك DoubleClick DART

                </Text>

                <Text style={styles.text}>
                    جوجل هو أحد البائعين الخارجيين على موقعنا. كما تستخدم ملفات تعريف الارتباط ، المعروفة باسم ملفات تعريف الارتباط DART ، لعرض الإعلانات على زوار موقعنا بناءً على زيارتهم لموقع www.website.com والمواقع الأخرى على الإنترنت. ومع ذلك ، قد يختار الزوار رفض استخدام ملفات تعريف الارتباط DART من خلال زيارة سياسة الخصوصية الخاصة بإعلانات Google وشبكة المحتوى على عنوان URL التالي - https://policies.google.com/technologies/ads

                </Text>


                <Text style={[styles.text, styles.textTitle]}>
                    سياسات خصوصية شركاء الإعلانات

                </Text>

                <Text style={styles.text}>
                    يمكنك الرجوع إلى هذه القائمة للعثور على سياسة الخصوصية لكل من شركاء الإعلان في Vinkst.

                </Text>


                <Text style={styles.text}>
                    تستخدم خوادم الإعلانات الخارجية أو شبكات الإعلانات تقنيات مثل ملفات تعريف الارتباط أو جافا سكريبت أو منارات الويب المستخدمة في الإعلانات والروابط الخاصة بكل منها والتي تظهر على Vinkst ، والتي يتم إرسالها مباشرة إلى متصفح المستخدمين. يتلقون عنوان IP الخاص بك تلقائيًا عند حدوث ذلك. تُستخدم هذه التقنيات لقياس فعالية حملاتهم الإعلانية و / أو لتخصيص محتوى الإعلان الذي تراه على مواقع الويب التي تزورها.

                </Text>

                <Text style={styles.text}>
                    لاحظ أن Vinkst ليس لديه حق الوصول أو التحكم في ملفات تعريف الارتباط هذه التي يستخدمها معلنون تابعون لجهات خارجية.

                </Text>

                <Text style={[styles.text, styles.textTitle]}>
                    سياسات خصوصية الطرف الثالث

                </Text>

                <Text style={styles.text}>
                    لا تنطبق سياسة خصوصية Vinkst على المعلنين أو المواقع الإلكترونية الأخرى. وبالتالي ، فإننا ننصحك بالرجوع إلى سياسات الخصوصية الخاصة بخوادم إعلانات الجهات الخارجية للحصول على معلومات أكثر تفصيلاً. قد يتضمن ممارساتهم وتعليماتهم حول كيفية الانسحاب من بعض الخيارات.

                </Text>
                <Text style={styles.text}>
                    يمكنك اختيار تعطيل ملفات تعريف الارتباط من خلال خيارات المتصفح الفردية الخاصة بك. لمعرفة المزيد من المعلومات التفصيلية حول إدارة ملفات تعريف الارتباط مع متصفحات الويب المحددة ، يمكن العثور عليها في مواقع الويب الخاصة بالمتصفحات.

                </Text>
                <Text style={[styles.text, styles.textTitle]}>
                    حقوق خصوصية CCPA (لا تبيع معلوماتي الشخصية)

                </Text>

                <Text style={styles.text}>
                    بموجب قانون حماية خصوصية المستهلك في كاليفورنيا ، من بين حقوق أخرى ، يحق للمستهلكين في كاليفورنيا:

                    اطلب من الشركة التي تجمع البيانات الشخصية للمستهلك أن تكشف عن فئات وأجزاء معينة من البيانات الشخصية التي جمعتها الشركة عن المستهلكين.

                    اطلب من شركة ما حذف أي بيانات شخصية عن المستهلك جمعتها الشركة.

                    اطلب من الشركة التي تبيع البيانات الشخصية للمستهلك ، ألا تبيع البيانات الشخصية للمستهلك.

                    إذا قمت بتقديم طلب ، فلدينا شهر واحد للرد عليك. إذا كنت ترغب في ممارسة أي من هذه الحقوق ، يرجى الاتصال بنا.

                </Text>
                <Text style={[styles.text, styles.textTitle]}>
                    حقوق حماية بيانات GDPR

                </Text>
                <Text style={styles.text}>
                    نود التأكد من أنك على دراية كاملة بجميع حقوق حماية البيانات الخاصة بك. يحق لكل مستخدم ما يلي:

                    الحق في الوصول - يحق لك طلب نسخ من بياناتك الشخصية. قد نفرض عليك رسومًا رمزية مقابل هذه الخدمة.

                    الحق في التصحيح - يحق لك أن تطلب منا تصحيح أي معلومات تعتقد أنها غير دقيقة. لديك أيضًا الحق في طلب إكمال المعلومات التي تعتقد أنها غير كاملة.

                    الحق في المسح - يحق لك طلب مسح بياناتك الشخصية ، في ظل ظروف معينة.

                    الحق في تقييد المعالجة - يحق لك طلب تقييد معالجة بياناتك الشخصية ، في ظل ظروف معينة.

                    الحق في الاعتراض على المعالجة - يحق لك الاعتراض على معالجتنا لبياناتك الشخصية ، في ظل ظروف معينة.

                    الحق في نقل البيانات - يحق لك أن تطلب منا نقل البيانات التي جمعناها إلى مؤسسة أخرى ، أو إليك مباشرةً ، في ظل ظروف معينة.

                    إذا قمت بتقديم طلب ، فلدينا شهر واحد للرد عليك. إذا كنت ترغب في ممارسة أي من هذه الحقوق ، يرجى الاتصال بنا.

                </Text>
                <Text style={[styles.text, styles.textTitle]}>
                    معلومات الأطفال

                </Text>
                <Text style={styles.text}>
                    جزء آخر من أولوياتنا هو إضافة حماية للأطفال أثناء استخدام الإنترنت. نشجع الآباء والأوصياء على مراقبة نشاطهم عبر الإنترنت والمشاركة فيه و / أو مراقبته وتوجيهه.

                    لا تجمع Vinkst عن قصد أي معلومات تعريف شخصية من الأطفال دون سن 13 عامًا. إذا كنت تعتقد أن طفلك قدم هذا النوع من المعلومات على موقعنا ، فنحن نشجعك بشدة على الاتصال بنا على الفور وسنبذل قصارى جهدنا للإزالة على الفور هذه المعلومات من سجلاتنا.
                </Text>
                <Text style={[styles.text, styles.textTitle]}>
                    التغييرات على سياسة الخصوصية هذه

                </Text>
                <Text style={styles.text}>
                    قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. وبالتالي ، ننصحك بمراجعة هذه الصفحة بشكل دوري لأية تغييرات. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة. تسري هذه التغييرات فور نشرها على هذه الصفحة.

                </Text>
                <Text style={[styles.text, styles.textTitle]}>
                    اتصل بنا

                </Text>

                <Text style={[styles.text]}>
                    إذا كان لديك أي أسئلة أو اقتراحات حول سياسة الخصوصية الخاصة بنا ، فلا تتردد في الاتصال بنا.

                </Text>


            </View>
        </ScrollView>
    )
}


const lightStyles = StyleSheet.create({
    container: {
        flex: 1,
        backgroundColor: "white",


    },

    content: {
        padding: 16,
        paddingTop: 56
    },


    title: {
        fontWeight: "bold",
        fotnSize: 16,
        color: "#212121",
        marginVertical: 16,
    },

    text: {
        fontSize: 14,
        color: "#555",
        marginVertical: 16,
    },
    textLine: {
        color: "#212121",
        fontWeight: "bold",
        paddingRight: 8,
        marginBottom: 12
    },
    textTitle: {
        fontSize: 18
    }
});


const darkStyles = {
    ...lightStyles,
    container: {
        flex: 1,
        backgroundColor: darkTheme.backgroudColor,


    },

    title: {
        fontWeight: "bold",
        fotnSize: 16,
        color: darkTheme.textColor,
        marginVertical: 16,
    },
    text: {
        fontSize: 14,
        color: darkTheme.secondaryTextColor,
        marginVertical: 16,
    },
    textLine: {
        color: darkTheme.textColor,
        fontWeight: "bold",
        paddingRight: 8,
        marginBottom: 12
    }
}